// ююююююю        Math metods (мез методс)     ююююююююююююююююююююююююююююю

// Math.pow() -- мез нукта пов дегани сони даражага кутариш имконини беради,
       // ушбу метод бмзга соннинг исталган даражасини топиб беради
       // Math -- бу хар доим бор нарса, pow -- методларни номланиши узгартириб туради
       // н-р, мы хотим  найти значенме а в 5ой степени:
       let a = 2;
       console.log(Math.pow(a, 5));
       //  в фиолетовые скобки пишем атрибуты, бу ерда иккита параметр курсанилган, биринчиси сон
       //  иккинчиси уни даражаси, смотрим результат и нам покажет 32

// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.sqrt() -- мез нукта эскуэрти -- бу метод факат илдизини (иккитали илдиз) топиб беради, уни ичида битта
       // параметр олади, н-р:
       let b = 4;
       console.log(Math.sqrt(b));

// llllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllll

// Math.cbrt() -- мез нукта сибиэрти -- бу метод кубик (учтали) илдизини олиб беради, н-р:
   let c = 8;
   console.log(Math.cbrt(c));

// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.pow()-- бу метод ёрдамида исталган даражали илдизини топиш хам мумкин, те, если мы 
       // хотим найти , н-р 4ый корень чмсла 16, это выглядит так:
       let d = 16;
       console.log(Math.pow(d, 1/4));

// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮюЮЮЮЮ

// Math.max()-- max дегани максимум деган суздан олинган, бу метод сонлар орасида энг
       // каттасини топиш учун ишлатилади, пример , даны какие-то чмсла:
       console.log(Math.max(3, 4, 677, 9, 77,88));
       //  здесь в консоли нам покажет самое большое, максимальное значение, в данном случае
       //  677
//ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.min() -- min дегани минимум деган суздан олинган, бу метод сонлар орасида энг
       // кичкинасини топиш учун ишлатилади , н-р, пример дан с пользованием arr (аррая)
       // где даны разного типа сведения,н-р типа стринга, типа null, те, употребляется
       // не то числа, но и тексты и др
        let arr = [2, 5, 6, 7, 44, 34, 67];
        console.log(Math.min(...arr));
// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.abs() -- бу метод соннинг модулини чикариб беради
        let f = - 23;
        console.log(Math.abs(f));
// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.round() -- вазифаси сонларни яхлитлаб беради, округляет, н-р
        let g = 2.34;
        console.log(Math.round(g));
        
        let g1 = 2.74;
        console.log(Math.round(g1));
//ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.ceil() --(сейл) сонни каср кисмини мавжуд булса уша сонни битта тепадаги сонга
        // айлантириб беради, здесь число округляется несмотря, сколько и какое число
        //  после точки, оно округляет до следующего числа, н-р:
        let h =2.3456;
        console.log(Math.ceil(h));
    // получаем  число 3

// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ
    
// Math.floor() -- факат бутун соннини чикариб беради, раками узини олиб беради, куп эмас,
        //  кам эмас, бунга факат битта атрибут куйиш керак
        let j = 2.33
        console.log(Math.floor(j));
        //  в результате мы увидим только целое число , в данном случае 2
// ЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮЮ

// Math.random() -- ушв соннинг ичидаги бизга ихтиёрий сон танглаб беради, рардом 
        // куринишида,м-н лотареяда
        console.log(Math.random());
        // здесь каждый раз выходит разное число от 0 до 1, но если нам нужны числа другого
        // диапазона, н-р от 0 до 10, тогда мы умножаем на 10 вот так:
        console.log(Math.random() * 10);
        // теперь нам надо совместить с дркгим методом, чтобы округлить число и получить
        //  целое , это делается так:
        console.log(Math.floor(Math.random() * 10));
        console.log(Math.floor(Math.random() * 7 + 1));
        //  чтобы не получать 0, делаем +1
        console.log(Math.PI);
        // это число пи




   








